# RegularPolygon

## Description
Creates an n-sided polygon.

```pascal
PROCEDURE RegularPolygon(
				centerX  : REAL;
				centerY  : REAL;
				radius   : REAL;
				numSides : INTEGER;
				mode     : INTEGER);
```

```python

def vs.RegularPolygon(centerX, centerY, radius, numSides, mode):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|centerX|REAL||
|centerY|REAL||
|radius|REAL||
|numSides|INTEGER||
|mode|INTEGER||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation